In [1]:
import numpy as np
import pandas as pd

In [2]:
d1 = pd.read_excel('datasheet.xlsx')

In [3]:
d1

   Sr. no.   name1 company1
0        1    reva      hcl
1        2    ravi       hp
2        3     ram     dell
3        4    riya    wipro
4        5   rinku      net
5        6  randiv      mac

In [4]:
d2 = pd.read_excel('datasheet.xlsx', sheet_name = 'Sheet2')

In [5]:
d2

   Index no.   name2 company2
0          1       0      hcl
1          2    ravi       hp
2          3     ram     dell
3          4    riya    wipro
4          5   rinku      net
5          6  randiv      mac